{
  "picture": "/static/img/me.png",
  "subtitle": "Sotware Engineer in Dublin",
  "short": [
    "My journey in the Computer Science world began in high-school where I had to program the microchip of automatic vacuum cleaner and fell in love with these pretty lines of code and knew that I wanted to spend a lot of time with them, hence why I moved to Nantes to study Computer Science for 6 years and get a Master’s degree with honours.",
    "I tend to be interested in any kind of Software job but I genuinely enjoy myself working with web technologies and most specifically JavaScript.",
    "No matter what I’m working on, I’m always trying to make it the neatest possible. I also love functional programming, open-source or TDD."
  ],
  "intro": [
    "I'm Antoine, a Software Engineer based in Dublin. I'm currently working at BrowserStack Ltd. I tend to be an open-source enthusiastic and have a lot of fun working with web technologies, especially JavaScript. I spend my spare time on the pitch for Railway Union RFC, building amazing projects or hanging around in some part of the world."
  ],
  "journey": [
    "My journey in the Computer Science world began in high-school where I had to program the microchip of automatic vacuum cleaner and fell in love with these pretty lines of code and knew that I wanted to spend a lot of time with them, hence why I moved to Nantes to study Computer Science at Institut Universitaire de Technologie de Nantes for a 2 years diploma.",
    "After receiving this diploma, I joined the Université de Nantes for a Bachelor's degree with the ambition to go over a Master's degree in Software Architecture after that. Which I did succesfully, I even managed to end the Master's at the first rank out of 40.",
    "My feeling about my studies is that I've been taugh not only to code but above all to adapt myself and absord a new language or a new technology quickly by linking it to concepts that I know. I'd say that's the best thing I got from my studies as it helps me to get ready to work properly in a quite fast manner.",
    "Right after having graduated, I moved to Dublin as it was actually a desire since couple of years to move abroad and we — my girlfriend and I — chose Ireland first for the English language indeed but also for the kindness of the people and the sumptuous landscapes.",
    "After seeking work for more than a month, I finally get hired as a Software Engineer at BrowserStack Ltd and officially started my career on the 5th of November 2018."
  ]
}