{
  "experiences": [
    {
      "jobtitle": "Software Engineer",
      "startdate": "Mon Nov 05 2018 09:00:00 GMT+0000",
      "enddate": null,
      "company": {
        "name": "BrowserStack Ltd, Dublin",
        "logo": "/static/img/bs-logo.jpg",
        "website": "https://browserstack.com",
        "description": "BrowserStack is the most reliable mobile app and browser testing platform, enaling developers to test their apps (web or mobile) over different model, different OS and different version."
      },
      "role": {
        "description": ["Development and maintenance of a mobile-driving platform that allows users to test their applications in a cross-devices and cross-browsers fashion. This platform consists of 3000+ devices and saves companies the cost of building their own \"lab\" internally."]
      },
      "tags": ["Ruby", "Bash", "Mobile"]
    },
    {
      "jobtitle": "Cloud&DevOps Intern",
      "startdate": "Mon Jan 18 2018 09:00:00 GMT+0000",
      "enddate": "Fri Jul 13 2018 17:00:00 GMT+0000",
      "company": {
        "name": "Voyages-SNCF Technologies, Nantes",
        "logo": "/static/img/oui-logo.jpg",
        "website": "https://ouitalk.oui.sncf/groupe",
        "description": "Voyages-SNCF Technologies — now rebranded 'E-Voyageur Technologies' — is part of the group Oui.sncf which is the first european train tickets retailer. VSCT acts as the primary provider of software and infrastructure for the group."
      },
      "role": {
        "description": ["Maintenance and customer support of an internal cloud based on OpenStack allowing dev teams to deploy their projects internally using Jenkins and Docker. Development of web utility tools for the team.", "Development of an automate solution to test the resiliency of an application deployed on AWS involving contributions to the chaostoolkit project.", "Development of a full-stack web application implementing a serious game of one-vs-one chaos resolution challenge, allowing to practise on-call skills at anytime."]
      },
      "tags": ["OpenStack", "Docker", "Swarm", "Jenkins", "Go", "Openfaas", "Angular", "ChaosEngineering", "AWS", "Python", "React.js", "Node.js", "MongoDB"]
    },
    {
      "jobtitle": "Cloud Intern",
      "company": {
        "name": "Discovery Initiative, Nantes",
        "logo": "/static/img/discovery-logo.png",
        "website": "http://beyondtheclouds.github.io/",
        "description": "The Discovery initiative aims to overcome the main limitations of the traditional server-centric cloud solutions by revising the OpenStack software in order to make it inherently cooperative."
      },
      "startdate": "Thu Jun 15 2017 09:00:00 GMT+0000",
      "enddate": "Thu Aug 31 2017 17:00:00 GMT+0000",
      "role": {
        "description": ["Improvement  of  an  internal  tool,  EnOs  (enos.readthedocs.io),  with  a profiling system. (Initiation course, 1 day per week over 4 month)", "Replacement of the mySQL backend of an OpenStack service (Keystone) by a distributed database (CockroachDB) in order to increase OpenStack scalability (Fog/Edge computing fashion)."]
      },
      "tags": ["OpenStack", "Cloud Computing", "Ansible", "Python", "Research"]
    }
  ]
}